Тестовая_база_ERP_14/src/InformationRegisters/РЭЙ_НастройкиВидимостиПодсистемыВЭД/РЭЙ_НастройкиВидимостиПодсистемыВЭД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РЭЙ_НастройкиВидимостиПодсистемыВЭД</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ДоступностьПодсистемыВЭД</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тестовая_база_ERP_14/src/InformationRegisters/РЭЙ_НастройкиВидимостиПодсистемыВЭД/ManagerModule.bsl
Процедура УстановитьИнициализационныеНастройки() Экспорт
	НаборЗаписей = РегистрыСведений.РЭЙ_НастройкиВидимостиПодсистемыВЭД.СоздатьНаборЗаписей();
	Запись = НаборЗаписей.Добавить();
	Запись.ДоступностьПодсистемыВЭД = Истина;
	Запись.Значение = Истина;
	Запись = НаборЗаписей.Добавить();
	Запись.ДоступностьПодсистемыВЭД = Ложь;
	Запись.Значение = Ложь;
	НаборЗаписей.Записать(Истина);
КонецПроцедуры
